/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ncoden <ncoden@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2015/02/03 11:03:54 by ncoden            #+#    #+#             */
/*   Updated: 2015/04/28 13:45:46 by ncoden           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"

int			main(void)
{
	int			len;

	ft_setunicode(UNI_UTF8);

	len = ft_printf("%S", L"ابتثجحخدذرزسشصضطظعغفقكلمنهوي");
	printf("\nlen = %d\n", len);
	len = printf("%S", L"ابتثجحخدذرزسشصضطظعغفقكلمنهوي");
	printf("\nlen = %d\n", len);
	return (0);
}
